Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: If another :ref:`thread <threading>` is calling LVGL functions, you may want to call :cpp:func:`lv_timer_handler` again very soon to handle the effects of those other threads.
it_it: Se un altro :ref:`thread <threading>` sta chiamando funzioni LVGL, si potrebbe voler chiamare di nuovo :cpp:func:`lv_timer_handler` molto presto per gestire gli effetti di quegli altri thread.

source: If any of the LVGL-related config has changed, the LVGL Editor will ask if the user wishes to update the `ui` project configuration accordingly.
it_it: Se una qualsiasi delle configurazioni relative a LVGL è cambiata, l'editor LVGL chiederà all'utente se desidera aggiornare di conseguenza la configurazione del progetto `ui`.

source: If applicable, the PN variable also contains any special suffix or prefix.
it_it: Se applicabile, la variabile PN contiene anche eventuali suffissi o prefissi speciali.

source: If background style properties are used, a rectangle will be drawn behind the Image Button.
it_it: Se vengono utilizzate le proprietà di stile del background, verrà disegnato un rettangolo dietro l'Image Button.

source: If chaining is disabled the propagation stops on the Widget and the parent(s) won't be scrolled.
it_it: Se il chaining è disabilitato, la propagazione si interrompe sul Widget e il genitore/i non verrà fatto scorrere.

source: If debugging you will want "debug".
it_it: Se si esegue il debug, scegliere "debug".

source: If desired, you can tell a data series to instead use a value array you provide.
it_it: Si può indicare a una serie di dati di utilizzare invece un array di valori fornito.

source: If either ``width`` or ``height`` are set to 0, only the cursor's lines are drawn.
it_it: Se ``width`` o ``height`` sono impostati su 0, vengono disegnate solo le linee del cursore.

source: If either the minimum or maximum value is reached with rollover enabled, and the user attempts to continue changing the value in the same direction, the value will change to the other limit.
it_it: Se viene raggiunto il valore minimo o massimo con il rollover abilitato e l'utente tenta di continuare a modificare il valore nella stessa direzione, il valore verrà modificato fino all'altro limite.

source: If enabled by :c:macro:`LV_LABEL_TEXT_SELECTION` part of the text can be selected.
it_it: Se abilitata tramite :c:macro:`LV_LABEL_TEXT_SELECTION`, è possibile selezionare parte del testo.

source: If enabled in ``lv_conf.h`` by setting :c:macro:`LV_USE_BMP` to ``1``, LVGL will register the BMP image decoder automatically so BMP files can be directly used as image sources.
it_it: Se abilitato in ``lv_conf.h`` impostando :c:macro:`LV_USE_BMP` a ``1``, LVGL registrerà automaticamente il decoder delle immagini BMP in modo che i file BMP possano essere utilizzati direttamente come sorgenti di immagini.

source: If enabled in ``lv_conf.h`` by setting :c:macro:`LV_USE_LODEPNG` to ``1``, LVGL will register a new image decoder automatically so PNG files can be used directly as an image source.
it_it: Se abilitato in ``lv_conf.h`` impostando :c:macro:`LV_USE_LODEPNG` a ``1``, LVGL registrerà automaticamente un nuovo decoder di immagini in modo che i file PNG possano essere utilizzati direttamente come sorgente di immagini.

source: If enabled the background image will be tiled.
it_it: Se abilitato, l'immagine di sfondo verrà ricolorata.

source: If everything went fine you should have now the file ``nuttx.bin`` to flash on your board:
it_it: Se tutto andasse a buon fine, si dovrebbe avere il file ``nuttx.bin`` da flashare sulla scheda:

source: If everything went fine you should have now the file ``nuttx``
it_it: Se tutto è andato bene, si avrà il file ``nuttx``

source: If everything went well, you should now found this file ``build/tmp/deploy/ rpm/cortexa53/lvgl-9.1.0-r0.cortexa53.rpm`` and other rpm files related to lvgl.
it_it: Se tutto è andato bene, si troverà il file ``build/tmp/deploy/ rpm/cortexa53/lvgl-9.1.0-r0.cortexa53.rpm`` e altri file rpm relativi a lvgl.

source: If focus is on last digit, focus moves to first digit.
it_it: Se il focus è sull'ultima cifra, il focus si sposta sulla prima.

source: If for any reason you can't delete the widget immediately, you can use :cpp:expr:`lv_obj_delete_async(widget)` which will perform the deletion on the next call of :cpp:func:`lv_timer_handler`.
it_it: Se per qualsiasi motivo non è possibile eliminare immediatamente il widget, è possibile utilizzare :cpp:expr:`lv_obj_delete_async(widget)`, che eseguirà l'eliminazione alla successiva chiamata di :cpp:func:`lv_timer_handler`.

source: If inevitable to use ``define``\ s export them with :cpp:expr:`LV_EXPORT_CONST_INT(defined_value)` right after the ``define``.
it_it: Se è inevitabile l'uso dei ``define`` esportarli con :cpp:expr:`LV_EXPORT_CONST_INT(defined_value)` subito dopo il ``define``.

source: If it does, you can simply :ref:`use LVGL's LTDC driver <stm32 ltdc driver>`.
it_it: In tal caso, si può semplicemente :ref:`usare il driver LTDC di LVGL <stm32 ltdc driver>`.

source: If it handled the task, it sets the Draw Task's ``state`` field to :cpp:enumerator:`LV_DRAW_TASK_STATE_FINISHED`.
it_it: Se ha gestito il task, si imposta il campo ``state`` del Draw Task su :cpp:enumerator:`LV_DRAW_TASK_STATE_FINISHED`.

source: If it hasn't happened automatically, Click "Arm Tools" on the bottom bar and then click "Activate Environment" in the list that appears.
it_it: Se non è avvenuto automaticamente, cliccare su "Arm Tools" nella barra in basso e poi su "Activate Environment" nell'elenco che appare.

source: If it is large enough for your SVGs, it will cache decoded SVG data so it does not need to be parsed every refresh, significantly reducing SVG redraw time.
it_it: Se è sufficientemente grande per i file SVG, memorizzerà nella cache i dati SVG decodificati in modo che non debbano essere analizzati ad ogni aggiornamento, riducendo significativamente i tempi di ridisegno SVG.

source: If it is mounted on /dev/sda, run the following command
it_it: Se è montata su /dev/sda, si esegue il seguente comando:

source: If it is supported, then an preferred score and the draw unit id will be set to the task.
it_it: Se supportato, all'attività verranno assegnati un punteggio preferito e l'ID dell'unità di disegno.

source: If it is then there needs to be an adjustment made to the script.
it_it: In tal caso, è necessario apportare una modifica allo script.

source: If it succeeds, you will have ``frogfs.bin`` which is the filesystem blob to embed in your LVGL application.
it_it: Se l'operazione ha esito positivo, si avrà ``frogfs.bin``, che è il blob del file system da incorporare nell'applicazione LVGL.

source: If it was 0 it will be 1.
it_it: Se era 0 sarà 1.

source: If it was the wrong one, it will fail and you will need to open the dropdown and choose "Program with Security Toolkit (select COM port)" to override the previous one which was saved as default.
it_it: Se è quella sbagliata, l'operazione fallirà e si dovrà aprire il menù a discesa e selezionare "Program with Security Toolkit (select COM port)" per sovrascrivere quella precedente che è stata salvata come default.

source: If it's ``false`` (default) stop at the min/max value, if ``true`` jump to the other end.
it_it: Se è ``false`` (il default) si ferma al valore min/max, se ``true`` salta all'altro estremo.

source: If it's higher, scroll vertically.
it_it: Se è più alto, scorre verticalmente.

source: If it's not, just type ``wsl --install`` and hit Enter.
it_it: In caso contrario, digitare ``wsl --install`` e premere "Enter".

source: If it's set other gradient related properties will be ignored'
it_it: Se impostato, le altre proprietà relative al gradiente verranno ignorate.

source: If just an integer is used as a size or position unit, it means the number of physical pixels on the display.
it_it: Se si utilizza solo un numero intero come unità di misura per le dimensioni o la posizione, si intende il numero di pixel fisici sul display.

source: If loading XML at runtime is not needed, LVGL's UI Editor can be used to export C and H files from the XML files of the Components.
it_it: Se non è necessario caricare XML a runtime, è possibile utilizzare l'editor dell'interfaccia utente di LVGL per esportare file C e H dai file XML dei componenti.

source: If more complex style properties were changed or added, and you know which Widget(s) are affected by that style call :cpp:expr:`lv_obj_refresh_style(widget, part, property)`.
it_it: Se sono state modificate o aggiunte proprietà di stile più complesse e si sanno quali Widget sono interessati da quello stile, si chiama :cpp:expr:`lv_obj_refresh_style(widget, part, property)`.

source: If more than one file system is enabled, each driver will need to have a unique driver-identifier letter.
it_it: Se è abilitato più di un file system, ogni driver dovrà avere una lettera identificativa univoca.

source: If more than one label is added, each label will share that space equally unless its FLEX GROW value is altered.
it_it: Se vengono aggiunte più etichette, ciascuna condividerà equamente lo spazio, a meno che il suo valore di FLEX GROW non venga modificato.

source: If most translations are known at compile time, they can be defined using string arrays:
it_it: Se la maggior parte delle traduzioni è nota in fase di compilazione, è possibile definirle utilizzando array di stringhe:

source: If needed you can easily catch the keys sent by an input device by subscribing to an indev event like this:
it_it: Se necessario, è possibile catturare facilmente i tasti inviati da un dispositivo di input sottoscrivendo un evento indev come questo:

source: If no Screen is being loaded, this function will return ``NULL``.
it_it: Se non viene caricato alcuno Screen, questa funzione restituirà ``NULL``.

source: If no callback is set, the driver uses the preferred mode by default.
it_it: Se non è impostata alcuna callback, il driver utilizza la modalità preferita per default.

source: If no name is provided, the default is ``<widget_type>_#``.
it_it: Se non viene specificato alcun nome, il valore predefinito è ``<widget_type>_#``.

source: If not already done, read the :ref:`learn_the_basics` (above).
it_it: Se non è stato già fatto, leggere :ref:`learn_the_basics` (sopra).

source: If not already read, start with :ref:`introduction` page of the documentation.
it_it: Se non è stato già fatto, iniziare con la pagina :ref:`introduction` della documentazione.

source: If not set then it will be inherited from the parent.
it_it: Se non impostata, verrà ereditata dal padre.

source: If omitted, ``NULL`` will be passed.
it_it: Se omesso, verrà passato ``NULL``.

source: If one is not supplied then it will be output to stdout.
it_it: Se non viene specificato, l'output verrà visualizzato su stdout.

source: If only ``opa`` and/or ``blend_mode`` is set to a non-default value LVGL can build the layer from smaller chunks.
it_it: Se solo ``opa`` e/o ``blend_mode`` sono impostate su un valore non predefinito, LVGL può creare il layer da blocchi più piccoli.

source: If only ``src_mid`` is specified, the width of the widget will be set automatically to the width of the image.
it_it: Se viene specificato solo ``src_mid``, la larghezza del widget verrà impostata automaticamente sulla larghezza dell'immagine.

source: If only one buffer is used, LVGL draws the content of the screen into that draw buffer and sends it to the display via the :ref:`flush_callback`.
it_it: Se viene utilizzato un solo buffer, LVGL disegna il contenuto dello schermo in quel buffer e lo invia al display tramite :ref:`flush_callback`.

source: If opacity is 0, no draw task will be created.
it_it: Se l'opacità è 0, non verrà creata alcun task di disegno.

source: If other Display Objects are created (to service additional Display Panels), the Default Display remains the first one created.
it_it: Se vengono creati altri Oggetti Display (per gestire altri Pannelli Display), quello di Default rimane il primo creato.

source: If possible, add the `-flto` compiler flag to enable link-time-optimisation together with `-Os` for GCC or `-Oz` for CLANG and newer GCC versions.
it_it: Se possibile, aggiungere il flag del compilatore `-flto` per abilitare l'ottimizzazione in fase di link insieme a `-Os` per GCC o `-Oz` per CLANG e le versioni più recenti di GCC.

source: If prompted with `Debug Configurations`, on the `Debugger` tab select the ``E2 Lite`` as `Debug hardware` and ``R5F572NN`` as `Target Device`:
it_it: Se viene richiesto `Debug Configurations`, sul tab `Debugger` selezionare il ``E2 Lite`` come `Debug hardware` e ``R5F572NN`` come `Target Device`:

source: If prompted with `Debug Configurations`, on the `Debugger` tab select the ``J-Link ARM`` as `Debug hardware` and the proper IC as `Target Device`:
it_it: Se viene richiesto `Debug Configurations`, sul tab `Debugger` selezionare ``J-Link ARM`` come `Debug hardware` e l'IC appropriato come `Target Device`:

source: If properly activated a **SPIFFS** file system based on the ``spiffs_image`` folder should be automatically generated and later flashed to the target
it_it: Se attivato correttamente, un file system **SPIFFS** basato sulla cartella ``spiffs_image`` dovrebbe essere generato automaticamente e successivamente flashato sul dispositivo di destinazione.

source: If rollover is disabled the value will stop at the minimum or maximum value.
it_it: Se il rollover è disabilitato, il valore si fermerà al valore minimo o massimo.

source: If set to ``0``, there is no limit.
it_it: Se impostato a ``0``, non c'è limite.

source: If set, a layer will be created for the widget and the layer will be masked with this A8 bitmap mask.
it_it: Se impostato, verrà creato un layer per il widget e il layer verrà mascherato con questa maschera bitmap A8.

source: If smaller areas are refreshed, it may result in fewer cores being used.
it_it: Se venissero aggiornate aree più piccole, potrebbe essere utilizzato un numero inferiore di core.

source: If snapshot is generated successfully, the image descriptor is updated, the image data will be stored to the provided ``draw_buf``, and the function will return :cpp:enumerator:`LV_RESULT_OK`.
it_it: Se lo snapshot viene generato correttamente, il descrittore dell'immagine viene aggiornato, i dati dell'immagine vengono memorizzati nel ``draw_buf`` fornito e la funzione restituisce :cpp:enumerator:`LV_RESULT_OK`.

source: If some resources are not supported on your board, refer to the official Zephyr documentation.
it_it: Se alcune risorse non sono supportate dalla propria board, consultare la documentazione ufficiale di Zephyr.

source: If static is set with :cpp:expr:`lv_dropdown_set_text(dropdown, "Some text")` it will be shown regardless of the selected item.
it_it: Se il testo statico è impostato con :cpp:expr:`lv_dropdown_set_text(dropdown, "Some text")`, verrà visualizzato indipendentemente dall'elemento selezionato.

source: If the "scroll on focus" feature is enabled LVGL will automatically scroll Widgets to bring the child Widget with focus into view.
it_it: Se la funzione "scroll on focus" è abilitata, LVGL scorrerà automaticamente i Widget per visualizzare il Widget figlio con focus.

source: If the :cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE` flag is set on the Top Layer, then it will absorb all user clicks and acts as a modal Widget.
it_it: Se il flag :cpp:enumerator:`LV_OBJ_FLAG_CLICKABLE` è impostato sul Layer Superiore, questo assorbirà tutti i clic dell'utente e fungerà da Widget modale.

source: If the DPI were only 80, ``lv_dpx(100)`` would return ``50``—only 50 pixels.
it_it: Se il DPI fosse solo 80, ``lv_dpx(100)`` restituirebbe ``50``, ovvero solo 50 pixel.

source: If the Spangroup Widget's ``mode != LV_SPAN_MODE_FIXED`` call :cpp:expr:`lv_spangroup_refr_mode(spangroup)` after you have modifying any of its Spans to ensure it is redrawn appropriately.
it_it: Se ``mode != LV_SPAN_MODE_FIXED`` del Widget Spangroup, si chiama :cpp:expr:`lv_spangroup_refr_mode(spangroup)` dopo aver modificato uno qualsiasi dei suoi Span per assicurarsi che venga ridisegnato correttamente.

source: If the Tile View is screen sized, the user interface resembles what you may have seen on smartwatches.
it_it: Se la Tile View è dimensionata per lo schermo, l'interfaccia utente assomiglia a quella ai potrebbe aver visto sugli smartwatch.

source: If the VG-Lite API returns the :c:macro:`VG_LITE_OUT_OF_RESOURCES` error, you can try increasing the size of the GPU memory pool or reducing the number of gradient cache entries.
it_it: Se l'API VG-Lite restituisce l'errore :c:macro:`VG_LITE_OUT_OF_RESOURCES`, si può provare ad aumentare la dimensione del pool di memoria della GPU o a ridurre il numero di voci nella cache dei gradienti.

source: If the VG-Lite API returns the :c:macro:`VG_LITE_OUT_OF_RESOURCES` error, you can try increasing the size of the GPU memory pool or reducing the number of stroke cache entries.
it_it: Se l'API VG-Lite restituisce l'errore :c:macro:`VG_LITE_OUT_OF_RESOURCES`, si può provare ad aumentare la dimensione del pool di memoria della GPU o a ridurre il numero di voci nella cache dei gradienti.

source: If the Widget can't find a property for its current state it will fall back to the default state's property.
it_it: Se il widget non riesce a trovare una proprietà per il suo stato attuale, tornerà alla proprietà dello stato di default.

source: If the Widget's width or height is set to a different value, the value of the ``inner_align`` property (set using :cpp:expr:`lv_image_set_inner_align(widget, align)`) governs how the image source is aligned inside the Widget.
it_it: Se la larghezza o l'altezza del Widget sono impostate su un valore diverso, il valore della proprietà ``inner_align`` (impostato tramite :cpp:expr:`lv_image_set_inner_align(widget, align)`) determina l'allineamento dell'immagine sorgente all'interno del Widget.

source: If the ``opa``, ``blend_mode``, ``transform_angle``, or ``transform_zoom`` properties are set to a non-default value LVGL creates a snapshot of the widget and its children in order to blend the whole widget with the set opacity, blend mode and transformation properties.
it_it: Se le proprietà ``opa``, ``blend_mode``, ``transform_angle`` o ``transform_zoom`` sono impostate su un valore non di default, LVGL crea un'istantanea del widget e dei suoi elementi secondari per fondere l'intero widget con le proprietà di opacità, modalità di fusione e trasformazione impostate.

source: If the backlight does not come on (or is too bright or dim), try changing the value of ``PWM_DUTY_BACKLIGHT_ON`` in ``lv_ft81x.c``, which can vary by board.
it_it: Se il "backlight " [retroilluminazione] non si accende (o è troppo luminoso o troppo fioco), provare a modificare il valore di ``PWM_DUTY_BACKLIGHT_ON`` in ``lv_ft81x.c``, che può variare a seconda della board.

source: If the base direction of the :cpp:enumerator:`LV_PART_SCROLLBAR` is RTL (:c:macro:`LV_BASE_DIR_RTL`) the vertical scrollbar will be placed on the left.
it_it: Se la direzione di base di :cpp:enumerator:`LV_PART_SCROLLBAR` è RTL (:c:macro:`LV_BASE_DIR_RTL`) la barra di scorrimento verticale verrà posizionata a sinistra.

source: If the base direction of the container is set the :cpp:enumerator:`LV_BASE_DIR_RTL` the meaning of :cpp:enumerator:`LV_FLEX_ALIGN_START` and :cpp:enumerator:`LV_FLEX_ALIGN_END` is swapped on ``ROW`` layouts.
it_it: Se la direzione di base del contenitore è impostata su :cpp:enumerator:`LV_BASE_DIR_RTL` il significato di :cpp:enumerator:`LV_FLEX_ALIGN_START` e :cpp:enumerator:`LV_FLEX_ALIGN_END` viene scambiato nei layout ``ROW``.

source: If the base direction of the container is set to :cpp:enumerator:`LV_BASE_DIR_RTL`, the meaning of :cpp:enumerator:`LV_GRID_ALIGN_START` and :cpp:enumerator:`LV_GRID_ALIGN_END` is swapped.
it_it: Se la direzione di base del contenitore è impostata su :cpp:enumerator:`LV_BASE_DIR_RTL`, il significato di :cpp:enumerator:`LV_GRID_ALIGN_START` e :cpp:enumerator:`LV_GRID_ALIGN_END` viene invertito.

source: If the blob is saved as a file (e.g., on an SD card), use :cpp:expr:`lv_xml_load_all_from_file`:
it_it: Se il blob viene salvato come file (ad esempio, su una scheda SD), si usa :cpp:expr:`lv_xml_load_all_from_file`:

source: If the blob is saved in memory mapped to addressable memory (flash, RAM, etc.), use :cpp:expr:`lv_xml_load_all_from_data`:
it_it: Se il blob viene salvato in una memoria mappata su una memoria indirizzabile (flash, RAM, ecc.), si usa :cpp:expr:`lv_xml_load_all_from_data`:

source: If the board LCD is controlled by the LTDC (LCD-TFT Display Controller) peripheral, you can use the :ref:`LVGL LTDC driver <stm32 ltdc driver>`.
it_it: Se il display LCD della scheda è controllato dalla periferica LTDC (LCD-TFT Display Controller), è possibile utilizzare il :ref:`driver LVGL LTDC <stm32 ltdc driver>`.

source: If the board is powered on before the screen, the kernel may incorrectly configure the framebuffer resolution.
it_it: Se la scheda madre viene accesa prima dello schermo, il kernel potrebbe configurare erroneamente la risoluzione del framebuffer.

source: If the bottom layer's opacity is also not :cpp:enumerator:`LV_OPA_COVER` LVGL will have no solid background to draw.
it_it: Se anche l'opacità del layer inferiore non è :cpp:enumerator:`LV_OPA_COVER`, LVGL non avrà uno sfondo uniforme da disegnare.

source: If the canvas area and source buffer are the same size, the source area can be left NULL.
it_it: Se l'area del canvas e il buffer sorgente hanno le stesse dimensioni, l'area sorgente può essere lasciata NULL.

source: If the center of the focal point and the center of the main circle are the same, the gradient will spread evenly in all directions.
it_it: Se il centro del punto focale e il centro del cerchio principale coincidono, il gradiente si distribuirà uniformemente in tutte le direzioni.

source: If the center points are not the same, the gradient will have an egg shape.
it_it: Se i punti centrali non coincidono, il gradiente avrà una forma a uovo.

source: If the chart is scrolled, the cursor moves with it.
it_it: Se si scorre il grafico, il cursore si sposta con esso.

source: If the child Widgets are arranged into a grid-like layout then the up, down, left and right arrows move focus to the nearest sibling in the respective direction.
it_it: Se i Widget figli sono in una disposizione a griglia, le frecce su, giù, sinistra e destra spostano il focus sul fratello più vicino nella rispettiva direzione.

source: If the code you would like to add is based on an article, post or comment on a website (e.g. StackOverflow) the license and/or rules of that site should be followed.
it_it: Se il codice da aggiungere è basato su un articolo, un post o un commento su un sito web (ad esempio StackOverflow), è necessario seguire la licenza e/o le regole di quel sito.

source: If the combination of ``old_style`` and ``selector`` exists multiple times in ``obj``\ 's styles, all occurrences will be replaced.
it_it: Se la combinazione di ``old_style`` e ``selector`` esiste più volte negli stili di ``obj``, tutte le occorrenze verranno sostituite.

source: If the comparison fails, an ``<image_name>_err.png`` file will be created with the rendered content next to the reference image.
it_it: Se il confronto fallisce, verrà creato un file ``<image_name>_err.png`` con il contenuto renderizzato accanto all'immagine di riferimento.

source: If the comparison fails, the X and Y coordinates of the first divergent pixel, along with the actual and expected colors, will also be printed.
it_it: Se il confronto fallisce, verranno stampate anche le coordinate X e Y del primo pixel divergente, insieme ai colori effettivi e previsti.
